In [6]:
import pandas as pd
import numpy as np

In [16]:
d1={'c1':[1,2,3], 'c2':[10,11,12]}
d2={'c1':[4,5,6], 'c2':[13,14,15]}
d3={'c1':[7,8,9], 'c2':[16,17,18]}

In [17]:
df1=pd.DataFrame(d1)

In [18]:
df1

   c1  c2
0   1  10
1   2  11
2   3  12

In [19]:
df2=pd.DataFrame(d2)

In [20]:
df2

   c1  c2
0   4  13
1   5  14
2   6  15

In [21]:
pd.concat([df1,df2])

   c1  c2
0   1  10
1   2  11
2   3  12
0   4  13
1   5  14
2   6  15

In [22]:
pd.merge(df1,df2,how='inner',on='c2')

Empty DataFrame
Columns: [c1_x, c2, c1_y]
Index: []

In [29]:
D1={'students':['Arjun','Kamlesh','Jaison'], 'marks':[10,11,12]}
D2={'Marks

In [30]:
df1=pd.DataFrame(D1)

In [31]:
df1

  students  marks
0    Arjun     10
1  Kamlesh     11
2   Jaison     12

In [1]:

d1={'student':['Arjun','Kamlesh','Pooja'],'Marks':[21,34,35]}
d2={'Marks':[21,34,35],'Course':['DS','SE','AI']}

In [4]:
import pandas as pd
df1=pd.DataFrame(d1)

In [9]:
df1

   student  Marks
0    Arjun     21
1  Kamlesh     34
2    Pooja     35

In [7]:
df2=pd.DataFrame(d2)

In [8]:
df2

   Marks Course
0     21     DS
1     34     SE
2     35     AI

In [10]:
pd.merge(df1,df2,how='inner',on='Marks')

   student  Marks Course
0    Arjun     21     DS
1  Kamlesh     34     SE
2    Pooja     35     AI

In [11]:
pd.merge(df1,df2,how='inner',on='Marks')

   student  Marks Course
0    Arjun     21     DS
1  Kamlesh     34     SE
2    Pooja     35     AI